soft_sweep_20260526_103027/B/bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f6ef4715c60>, trust_remote_code=False, seed=0, num_prompts=8, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label='B', backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='Qwen3-32B', input_len=1024, output_len=4096, tokenizer='/data/models/Qwen3-32B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=True, num_warmups=1, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/scd/MG-SD/soft_sweep_20260526_103027/B', result_filename='result.json', ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-8cf3f5a7-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='Qwen3-32B', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 05-26 10:47:22 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [4096, 4096]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     8         
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  229.81    
Total input tokens:                      8192      
Total generated tokens:                  32768     
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         142.59    
Peak output token throughput (tok/s):    40.00     
Peak concurrent requests:                5.00      
Total token throughput (tok/s):          178.23    
---------------Time to First Token----------------
Mean TTFT (ms):                          703.64    
Median TTFT (ms):                        503.54    
P99 TTFT (ms):                           1305.30   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.30     
Median TPOT (ms):                        25.16     
P99 TPOT (ms):                           30.04     
---------------Inter-token Latency----------------
Mean ITL (ms):                           110.56    
Median ITL (ms):                         108.07    
P99 ITL (ms):                            134.00    
---------------Speculative Decoding---------------
Acceptance rate (%):                     71.06     
Acceptance length:                       4.55      
Drafts:                                  7200      
Draft tokens:                            36000     
Accepted tokens:                         25582     
Per-position acceptance (%):
  Position 0:                            86.47     
  Position 1:                            76.94     
  Position 2:                            69.18     
  Position 3:                            63.62     
  Position 4:                            59.08     
==================================================